[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 20,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "A beginner-friendly acoustic guitar learning path designed for students who have never touched a guitar before. This lesson covers essential chords, smooth chord transitions, strumming rhythm patterns, finger positioning, and timing practice. You will also learn how to hold the guitar comfortably, tune your instrument, and follow a simple daily practice routine. By the end of the sessions, you’ll be able to play basic songs, maintain rhythm, and build confidence for further musical progress.",
    "image": "https://i.ibb.co.com/JfZyXSg/Beginner-Guitar-Lessons.jpg",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "price": 10,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "These sessions focus on building fluency, confidence, and natural speaking flow for non-native English learners. You will practice everyday conversations, pronunciation correction, sentence structure improvement, and vocabulary expansion. Interactive dialogue activities help reduce hesitation and increase clarity while speaking. The goal is to help you express ideas comfortably in real-life situations like meetings, interviews, and social communication.",
    "image": "https://i.ibb.co.com/pjyKR3Hx/spoken-english.jpg",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "React Basics Bootcamp",
    "providerName": "Rafi Ahmed",
    "providerEmail": "rafi@skillswap.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "A hands-on introduction to React where beginners learn how modern web interfaces work. This bootcamp covers components, props, state management, event handling, conditional rendering, and the basics of React Hooks. You will build small interactive features to understand how React updates the UI efficiently. By the end, you’ll be confident working with reusable components and structuring simple React applications on your own.",
    "image": "https://i.ibb.co.com/jkJdHgXC/react-basic-bootcamp.png",
    "category": "Coding"
  },
  {
    "skillId": 4,
    "skillName": "Yoga for Beginners",
    "providerName": "Mina Roy",
    "providerEmail": "mina@skillswap.com",
    "price": 15,
    "rating": 4.7,
    "slotsAvailable": 6,
    "description": "Gentle beginner-level yoga sessions designed to improve flexibility, posture, and breathing. You’ll practice simple poses suitable for all body types, along with guided relaxation and mindful stretching. Each session focuses on reducing stress, improving balance, and building core strength safely. Perfect for anyone wanting a calm, refreshing start to wellness without pressure or difficulty.",
    "image": "https://i.ibb.co.com/S7Ztv1bx/Yoga-for-beginners.png",
    "category": "Health"
  },
  {
    "skillId": 5,
    "skillName": "Bangla Calligraphy",
    "providerName": "Kamrul Hasan",
    "providerEmail": "kamrul@skillswap.com",
    "price": 12,
    "rating": 4.5,
    "slotsAvailable": 8,
    "description": "This session teaches the beautiful art of Bengali handwriting and brush lettering. You’ll learn stroke control, pen angles, spacing, and formation of letters with proper flow. Step-by-step worksheets help you develop cleaner, balanced writing. Ideal for students, artists, or anyone who wants to create elegant Bangla titles, banners, or creative artwork.",
    "image": "https://i.ibb.co.com/mZCYbJ8/Bangla-Calligraphy.jpg",
    "category": "Art"
  },
  {
    "skillId": 6,
    "skillName": "Basic Photography",
    "providerName": "Nadia Khan",
    "providerEmail": "nadia@skillswap.com",
    "price": 18,
    "rating": 4.6,
    "slotsAvailable": 2,
    "description": "A simple and beginner-oriented introduction to camera handling, composition, and lighting. You’ll learn how to use manual settings, create depth, capture natural light, and take clear, eye-pleasing photos. The course also includes basic editing tips to enhance color and sharpness. Great for hobbyists starting their photography journey.",
    "image": "https://i.ibb.co.com/HTHBbrXy/Basic-Photography.webp",
    "category": "Photography"
  },
  {
    "skillId": 7,
    "skillName": "Web Design Fundamentals",
    "providerName": "Imran Shakil",
    "providerEmail": "imran@skillswap.com",
    "price": 22,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "A practical introduction to creating modern, visually pleasing websites. You’ll learn layout structure, spacing, color theory, typography, and responsive design principles. The session includes hands-on practice with real UI examples so you understand what makes a design clean and user-friendly. Suitable for beginners who want to build beautiful web pages.",
    "image": "https://i.ibb.co.com/wZLqqkGz/maxresdefault.jpg",
    "category": "Design"
  },
  {
    "skillId": 8,
    "skillName": "Cooking Basics",
    "providerName": "Chef Arif",
    "providerEmail": "arif@skillswap.com",
    "price": 14,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "A friendly cooking starter course covering essential kitchen skills, basic recipes, safety tips, and ingredient handling. You’ll learn chopping techniques, seasoning balance, and how to prepare simple healthy meals. Perfect for beginners wanting confidence in everyday cooking.",
    "image": "https://i.ibb.co.com/whF3dpyC/cooking-basics.jpg",
    "category": "Cooking"
  },
  {
    "skillId": 9,
    "skillName": "Public Speaking Training",
    "providerName": "Tania Rahman",
    "providerEmail": "tania@skillswap.com",
    "price": 18,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "These sessions help you reduce stage fear, improve body language, and speak clearly with confidence. You’ll practice structured speech delivery, voice control, and audience engagement techniques. Ideal for students, professionals, or anyone who wants to communicate effectively.",
    "image": "https://i.ibb.co.com/1tGMbpNb/public-speaking-training.png",
    "category": "Communication"
  },
  {
    "skillId": 10,
    "skillName": "Basic Video Editing",
    "providerName": "Rahat Hasan",
    "providerEmail": "rahat@skillswap.com",
    "price": 20,
    "rating": 4.6,
    "slotsAvailable": 3,
    "description": "Learn the core principles of video editing using beginner-friendly tools. You’ll explore trimming, transitions, audio syncing, color correction, and simple storytelling techniques. By the end, you’ll be able to edit clean, smooth videos suitable for social media or personal projects.",
    "image": "https://i.ibb.co.com/ks9Vwnt7/basic-video-editing.jpg",
    "category": "Editing"
  },
  {
    "skillId": 11,
    "skillName": "Digital Marketing Starter",
    "providerName": "Sadia Noor",
    "providerEmail": "sadia@skillswap.com",
    "price": 16,
    "rating": 4.7,
    "slotsAvailable": 7,
    "description": "An introductory guide to SEO, content strategy, and social media promotion. You’ll learn how online visibility works, how to target the right audience, and how to create effective marketing posts. Great for beginners wanting to understand digital growth.",
    "image": "https://i.ibb.co.com/PsKp4tgh/digital-marketing-starter.jpg",
    "category": "Marketing"
  },
  {
    "skillId": 12,
    "skillName": "Basic Drawing Lessons",
    "providerName": "Mehedi Arts",
    "providerEmail": "mehedi@skillswap.com",
    "price": 12,
    "rating": 4.4,
    "slotsAvailable": 8,
    "description": "A beginner’s path to improving drawing skills through lines, shapes, forms, and shading techniques. You’ll learn step-by-step sketching with easy exercises to build hand control and creativity. Suitable for anyone wanting to start art from scratch.",
    "image": "https://i.ibb.co.com/svQMHChR/25-days-to-better-drawings-course-tumb.jpg",
    "category": "Art"
  },
  {
    "skillId": 13,
    "skillName": "Fitness Workout Basics",
    "providerName": "Jonas Paul",
    "providerEmail": "jonas@skillswap.com",
    "price": 15,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "A simple fitness routine designed for beginners. You’ll learn stretching, light workouts, posture correction, and safe exercise techniques. These sessions help improve strength, flexibility, and overall health with easy-to-follow steps.",
    "image": "https://i.ibb.co.com/NMX28KW/muscular-man-lifting-weights-1.webp",
    "category": "Health"
  },
  {
    "skillId": 14,
    "skillName": "Math Tutoring (Grade 6–10)",
    "providerName": "Shuvo Dev",
    "providerEmail": "shuvo@skillswap.com",
    "price": 10,
    "rating": 4.9,
    "slotsAvailable": 5,
    "description": "Covers algebra, geometry, ratio, word problems, and exam-oriented techniques. Lessons include clear explanations, practice questions, and problem-solving shortcuts to help students build confidence and score better in exams.",
    "image": "https://i.ibb.co.com/gFcP6GHD/Women-Tutoring-maths-in-the-blackboard-1024x683.jpg",
    "category": "Education"
  },
  {
    "skillId": 15,
    "skillName": "Basic Arabic Reading",
    "providerName": "Abdullah Karim",
    "providerEmail": "abdullah@skillswap.com",
    "price": 9,
    "rating": 4.6,
    "slotsAvailable": 10,
    "description": "An easy step-by-step guide to recognizing Arabic letters, joining rules, and correct pronunciation. Perfect for beginners who want to read Arabic smoothly with proper understanding and clarity.",
    "image": "https://i.ibb.co.com/fYZZmqtG/basic-arabic-reading.jpg",
    "category": "Language"
  },
  {
    "skillId": 16,
    "skillName": "UI/UX Fundamentals",
    "providerName": "Ruma Akter",
    "providerEmail": "ruma@skillswap.com",
    "price": 24,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "A beginner-friendly path to understanding how digital interfaces work. You’ll learn user research basics, wireframing, design patterns, and simple prototyping. Great for anyone wanting to start UI/UX design with practical, clear concepts.",
    "image": "https://i.ibb.co.com/HfcfNXqg/ui-ux-fundamental.png",
    "category": "Design"
  }
]
